<?php

// Категории новостей
$tCat[1]="Ивент";
$tCat[2]="Обновление";
$tCat[3]="Акция";
$tCat[4]="Инфо";


//Название классов
$CountryJob=array(
    0=>array(
        0=>'Боец',
        1=>'Хранитель',
        2=>'Разведчик',
        3=>'Лучник',
        4=>'Маг',
        5=>'Жрец'),
    1=>array(
        0=>'Воин',
        1=>'Страж',
        2=>'Наёмник',
        3=>'Охотник',
        4=>'Колдун',
        5=>'Оракул')
);
//Название фракций
$faction_name = array("Альянс Света", "Союз Ярости", "Не выбрана", "Не выбрана");
//Статусы ежедневной награды
$DayStatus_name = array("Недоступна", "Доступна", "Получено");

//Названия статов
$stats_name = array("","Str","Dex","Rec","Int","Wis","Luc");
//Иконка статуса ежедневной награды
$DayStatus_icon = array("fa fa-times", "fa fa-star", "fa fa-check");
//Ранги (Класс)
$job_icon=array(
    0=>'i17 center',
    1=>'i18 center',
    2=>'i19 center',
    3=>'i20 center',
    4=>'i21 center',
    5=>'i22 center'
);
$faction_icon = array("faction-light", "faction-dark", "", "");

$country_in=array(0,0,1,1);
$family_in=array(0=>0,1=>0,2=>1,3=>1);

$ArmorTypes = array(16,17,18,19,20,21,24,31,32,33,34,35,36,39,67,68,69,70,71,72,73,74,76,77,82,83,84,85,86,87,88,89,91,92);
$WeaponTypes = array(1,2,3,4,5,6,7,8,9,10,11,12,13,14,15,45,46,47,48,49,50,51,52,53,54,55,56,57,58,59,60,61,62,63,64,65);

$EnchantPrice = array(
	"armor" => array (
		0 => 0,
		1 => 10,
		2 => 10,
		3 => 10,
		4 => 10,
		5 => 10,
		6 => 100,
		7 => 200,
		8 => 300,
		9 => 600,
		10 => 1200,
		//11 => 11000,
		//12 => 12000,
		//13 => 13000,
		//14 => 14000,
		//15 => 15000,
		//16 => 16000,
		//17 => 17000,
		//18 => 18000,
		//19 => 19000,
		//20 => 20000,
	),
	"weapon" => array (
		0 => 0,
		1 => 10,
		2 => 10,
		3 => 10,
		4 => 10,
		5 => 10,
		6 => 100,
		7 => 200,
		8 => 300,
		9 => 600,
		10 => 1200,
		//11 => 11000,
		//12 => 12000,
		//13 => 13000,
		//14 => 14000,
		//15 => 15000,
		//16 => 16000,
		//17 => 17000,
		//18 => 18000,
		//19 => 19000,
		//20 => 20000,
	),
);

$GemPrice = array(

//ALL Ele Lapis Lv1
	67 => 2000,
	68 => 2000,
	69 => 2000,
	70 => 2000,
	146 => 2000,
	147 => 2000,
	148 => 2000,
	149 => 2000,

//ALL Flash/Sonic
	65 => 2500,
	107 => 3000,

//ALL Helmet Lapis Lv1
	227 => 200,
	228 => 200,
	229 => 200,
	230 => 200,
	231 => 200,
	232 => 200,
	
	
	
	
//ALL DUAL LAPIS LV1-4
	203 => 10,	
	204 => 10,	
	205 => 10,	
	206 => 10,	
	207 => 10,	
	208 => 10,
	209 => 10,
	210 => 10,
	211 => 10,
	212 => 10,
	213 => 10,
	214 => 10,
	215 => 10,
	216 => 10,
	217 => 10,
	218 => 10,
	219 => 10,
	220 => 10,
	221 => 10,
	222 => 10,
	223 => 10,
	224 => 10,
	225 => 10,
	226 => 10,
	
//ALL LAPIS LV5
	5 => 50,
	12 => 50,
	19 => 50,
	26 => 50,
	33 => 50,
	40 => 50,
	80 => 50,
	87 => 50,
	94 => 50,
	103 => 50,	
	
	
//ALL LAPIS LV6
	6 => 300,
	13 => 300,
	20 => 300,
	27 => 300,
	34 => 300,
	41 => 300,
	81 => 300,
	88 => 300,
	95 => 300,
	104 => 300,

//ALL Accesorie Lapis
	190 => 200,	
	191 => 200,
	192 => 200,
	193 => 200,
	194 => 200,
	195 => 200,
	196 => 200,
	197 => 200,
	198 => 200,
	199 => 200,
	200 => 200,
	201 => 200,
	202 => 200,
	250 => 200,
	251 => 200,
	252 => 200,
		
);
